// Задача 34: Написать программу для замены элементов массива на противоположные.
Console.WriteLine("Hello, World!");
