// Задача 36: Задать массив, заполнить случайными положительными трёхзначными числами. 
// Показать количество нечётных/чётных чисел.
Console.WriteLine("Hello, World!");
